## CRIANDO DATAFRAME COM (PANDAS)

In [1]:
# IMPORTAR O PACOTE PANDAS O MODULO DATAFRAME
from pandas import DataFrame

In [2]:
# CRIA O DATABASE
data = {'estado':['são paulo','rio de janeiro','paraná','minas gerais','amazonia'],
        'ano':[2002,2005,2008,2025,2017],
        'população':[1.7,2.5,1.4,3.2,2.0]}
frame01 = DataFrame(data)
frame01

           estado   ano  população
0       são paulo  2002        1.7
1  rio de janeiro  2005        2.5
2          paraná  2008        1.4
3    minas gerais  2025        3.2
4        amazonia  2017        2.0

In [3]:
type(frame01)

pandas.core.frame.DataFrame

In [4]:
# DA ORDEM AS COLUNAS DO DATABASE
DataFrame(data, columns= ['população','estado','ano'])

   população          estado   ano
0        1.7       são paulo  2002
1        2.5  rio de janeiro  2005
2        1.4          paraná  2008
3        3.2    minas gerais  2025
4        2.0        amazonia  2017

In [5]:
# ADDICIONA UMA COLUNA E INDICES AO DATAFRAME
frame02 = DataFrame(data,
                   columns=['estado','ano','população','debito'],
                    index=['um','dois','treis','quatro','cinco'])
frame02

                estado   ano  população debito
um           são paulo  2002        1.7    NaN
dois    rio de janeiro  2005        2.5    NaN
treis           paraná  2008        1.4    NaN
quatro    minas gerais  2025        3.2    NaN
cinco         amazonia  2017        2.0    NaN

In [6]:
# CHAMA O INDICE E COLUNA
frame02['estado']

um             são paulo
dois      rio de janeiro
treis             paraná
quatro      minas gerais
cinco           amazonia
Name: estado, dtype: object

In [7]:
# CHAMA O INDICE E COLUNA
frame02.ano

um        2002
dois      2005
treis     2008
quatro    2025
cinco     2017
Name: ano, dtype: int64

In [8]:
# FORMATO DA VARIAVEL
type(frame02)

pandas.core.frame.DataFrame

In [9]:
# INDEXAÇÃO
frame02.index

Index(['um', 'dois', 'treis', 'quatro', 'cinco'], dtype='object')

In [10]:
# COLUNAS
frame02.columns

Index(['estado', 'ano', 'população', 'debito'], dtype='object')

In [11]:
# VALORES DA VARIAVEL
frame02.values

array([['são paulo', 2002, 1.7, nan],
       ['rio de janeiro', 2005, 2.5, nan],
       ['paraná', 2008, 1.4, nan],
       ['minas gerais', 2025, 3.2, nan],
       ['amazonia', 2017, 2.0, nan]], dtype=object)

In [12]:
# TIPOS DE ITEM PARA CADA COLUNA
frame02.dtypes

estado        object
ano            int64
população    float64
debito        object
dtype: object

In [13]:
# FAZEMOS (SLICING) = FATIAMENTO DE TABELA EM LINHAS
frame02[0:2]

              estado   ano  população debito
um         são paulo  2002        1.7    NaN
dois  rio de janeiro  2005        2.5    NaN

In [15]:
frame02.values

array([['são paulo', 2002, 1.7, nan],
       ['rio de janeiro', 2005, 2.5, nan],
       ['paraná', 2008, 1.4, nan],
       ['minas gerais', 2025, 3.2, nan],
       ['amazonia', 2017, 2.0, nan]], dtype=object)

In [16]:
frame02.describe()

               ano  população
count     5.000000   5.000000
mean   2011.400000   2.160000
std       9.449868   0.709225
min    2002.000000   1.400000
25%    2005.000000   1.700000
50%    2008.000000   2.000000
75%    2017.000000   2.500000
max    2025.000000   3.200000

In [17]:
frame02['dois':'quatro']

                estado   ano  população debito
dois    rio de janeiro  2005        2.5    NaN
treis           paraná  2008        1.4    NaN
quatro    minas gerais  2025        3.2    NaN

In [18]:
frame02.loc['quatro']

estado       minas gerais
ano                  2025
população             3.2
debito                NaN
Name: quatro, dtype: object

In [19]:
frame02.iloc[3]

estado       minas gerais
ano                  2025
população             3.2
debito                NaN
Name: quatro, dtype: object

In [20]:
web_status = {'site': ['mgsitesanddhost.com','mgviagens.com','maurogallotta.com','examesnamao.com.br'],
              'dias':['22/01','22/05','24/05','30/06'],
              'visitantes':['20000','12345','4040','103'],
              'taxas':[2.5,3.9,7.8,9.2]}
web_status

{'site': ['mgsitesanddhost.com',
  'mgviagens.com',
  'maurogallotta.com',
  'examesnamao.com.br'],
 'dias': ['22/01', '22/05', '24/05', '30/06'],
 'visitantes': ['20000', '12345', '4040', '103'],
 'taxas': [2.5, 3.9, 7.8, 9.2]}

In [21]:
web_status_df = DataFrame(web_status)
type(web_status_df)

pandas.core.frame.DataFrame

In [22]:
print(web_status_df)

                  site   dias visitantes  taxas
0  mgsitesanddhost.com  22/01      20000    2.5
1        mgviagens.com  22/05      12345    3.9
2    maurogallotta.com  24/05       4040    7.8
3   examesnamao.com.br  30/06        103    9.2

In [23]:
print(web_status_df.set_index('taxas'))

                      site   dias visitantes
taxas
2.5    mgsitesanddhost.com  22/01      20000
3.9          mgviagens.com  22/05      12345
7.8      maurogallotta.com  24/05       4040
9.2     examesnamao.com.br  30/06        103

In [24]:
print(web_status_df[['taxas','dias']])

   taxas   dias
0    2.5  22/01
1    3.9  22/05
2    7.8  24/05
3    9.2  30/06

## Panda  & NumPy

In [ ]:
# IMPORTANDO NUMPY
import numpy as np

In [14]:
frame02['debito'] = np.arange(5.)
frame02

NameError: name 'np' is not defined